In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

from numpy.random import randn

In [2]:
ser = Series(np.random.randn(6),index=[[1,1,1,2,2,2],['a','b','c','a','b','c']])
ser

1  a   -1.885293
   b   -1.789650
   c    0.187012
2  a   -0.219313
   b    0.159877
   c    0.332527
dtype: float64

In [3]:
ser.describe()

count    6.000000
mean    -0.535807
std      1.025071
min     -1.885293
25%     -1.397066
50%     -0.029718
75%      0.180228
max      0.332527
dtype: float64

In [4]:
ser.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [5]:
ser[1]

a   -1.885293
b   -1.789650
c    0.187012
dtype: float64

In [6]:
ser[2]

a   -0.219313
b    0.159877
c    0.332527
dtype: float64

In [7]:
ser

1  a   -1.885293
   b   -1.789650
   c    0.187012
2  a   -0.219313
   b    0.159877
   c    0.332527
dtype: float64

In [8]:
ser[:,'a']

1   -1.885293
2   -0.219313
dtype: float64

In [9]:
dframe = ser.unstack()
dframe

          a         b         c
1 -1.885293 -1.789650  0.187012
2 -0.219313  0.159877  0.332527

In [11]:
dframe.unstack()

a  1   -1.885293
   2   -0.219313
b  1   -1.789650
   2    0.159877
c  1    0.187012
   2    0.332527
dtype: float64

In [12]:
dframe.T.unstack()

1  a   -1.885293
   b   -1.789650
   c    0.187012
2  a   -0.219313
   b    0.159877
   c    0.332527
dtype: float64

In [13]:
dframe2 = DataFrame(np.arange(16).reshape((4,4)),
                   index=[['a','a','b','b'],[1,2,1,2]],
                    columns=[['NY','NY','LA','SF'],['cold','hot','hot','cold']])

In [14]:
dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [15]:
dframe2.index.names = ['INDEX_1','INDEX_2']

In [16]:
dframe2

                  NY      LA   SF
                cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [17]:
dframe2.columns.names = ['Cities','Temp']
dframe2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [18]:
dframe2.swaplevel('Cities','Temp',axis=1)

Temp            cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [21]:
dframe2.sort_index(level=1).sort_index(level=0)

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [22]:
dframe2.sum(level='Temp', axis=1)

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27